# Flipped Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DividedPath..::..Flipped Property
DividedPath Class See Also
---
If the divided path is flipped the nodes are numbered in the reverse order. It also switches the ends from which beginningIndent and endIndent are measured from.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool Flipped { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Flipped As Boolean
	Get
```

Visual C++
---
```text
public:
property bool Flipped {
	bool get ();
}
```

# See Also
DividedPath Class
Autodesk.Revit.DB Namespace